#==============================================================================
# ■ステート付与と解除時にコモンイベント for RGSS3 Ver1.00-β
# □作成者 kure
#===============================================================================

#==============================================================================
# ■ RPG::State(追加定義)
#==============================================================================
class RPG::State < RPG::BaseItem
  #--------------------------------------------------------------------------
  # ★ 付与時コモン(追加定義)
  #--------------------------------------------------------------------------  
  def add_common_id
    @note.match(/<付与時コモン\s?(\d+)\s?>/)
    return $1 ? $1.to_i : nil
  end
  #--------------------------------------------------------------------------
  # ★ 付与時コモン(追加定義)
  #--------------------------------------------------------------------------  
  def remove_common_id
    @note.match(/<解除時コモン\s?(\d+)\s?>/)
    return $1 ? $1.to_i : nil
  end  
end

#==============================================================================
# ■ Game_Actor
#==============================================================================
class Game_Actor < Game_Battler
  #--------------------------------------------------------------------------
  # ◎ 新しいステートの付加(エイリアス再定義)
  #--------------------------------------------------------------------------
  alias k_state_trigger_common_add_new_state add_new_state unless $!
  def add_new_state(state_id)
    k_state_trigger_common_add_new_state(state_id)
    
    state = $data_states[state_id]
    $game_temp.reserve_common_event(state.add_common_id) if state.add_common_id
  end
  #--------------------------------------------------------------------------
  # ◎ ステートの消去(エイリアス再定義)
  #--------------------------------------------------------------------------
  alias k_state_trigger_common_erase_state erase_state unless $!
  def erase_state(state_id)
    k_state_trigger_common_erase_state(state_id)
    
    state = $data_states[state_id]
    $game_temp.reserve_common_event(state.remove_common_id) if state.remove_common_id
  end
end